cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV_LPC111x_LV.svd
<?xml version="1.0" encoding="utf-8"?> 

 

<!--
	Software that is described herein is for illustrative purposes only
	which provides customers with programming information regarding the
	products. This software is supplied "AS IS" without any warranties.
	NXP Semiconductors assumes no responsibility or liability for the
	use of the software, conveys no license or title under any patent,
	copyright, or mask work right to the product. NXP Semiconductors
	reserves the right to make changes in the software without
	notification. NXP Semiconductors also make no representation or
	warranty that such application will be suitable for the specified
	use without further testing or modification.	
	
-->	


<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd" >
  <name>LPC11xxLV_LPC111x_LV</name>
  <version>1</version>
  <description>LPC11xxLV</description>
  <!-- Bus Interface Properties -->
  <!-- Cortex-M0 is byte addressable -->
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>	
	
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix> 
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  
  <peripherals>
	<peripheral>
        <name>I2C</name>
        <description>I2C</description>
        <groupName>I2C</groupName>
        <baseAddress>0x40000000</baseAddress>
		<addressBlock>
			<offset>0</offset>
			<size>0xFFF</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>I2C</name>
			<value>15</value>
		</interrupt>
		<registers>																
			<register>															
				<name>CONSET</name>														
				<description>I2C Control Set Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is set. Writing a zero has no effect on the corresponding bit in the I2C control register.</description>														
				<addressOffset>0x000</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
						<bitRange>[1:0]</bitRange>												
					</field>													
					<field>													
						<name>AA</name>												
						<description>Assert acknowledge flag.</description>												
						<bitRange>[2:2]</bitRange>												
					</field>													
					<field>													
						<name>SI</name>												
						<description>I2C interrupt flag.</description>												
						<bitRange>[3:3]</bitRange>												
					</field>													
					<field>													
						<name>STO</name>												
						<description>STOP flag.</description>												
						<bitRange>[4:4]</bitRange>												
					</field>													
					<field>													
						<name>STA</name>												
						<description>START flag.</description>												
						<bitRange>[5:5]</bitRange>												
					</field>													
					<field>													
						<name>I2EN</name>												
						<description>I2C interface enable.</description>												
						<bitRange>[6:6]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:7]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>STAT</name>														
				<description>I2C Status Register. During I2C operation, this register provides detailed status codes that allow software to determine the next action needed.</description>														
				<addressOffset>0x004</addressOffset>														
				<access>read-only</access>														
				<resetValue>0xF8</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>RESERVED</name>												
						<description>These bits are unused and are always 0.</description>												
						<bitRange>[2:0]</bitRange>												
					</field>													
					<field>													
						<name>Status</name>												
						<description>These bits give the actual status information about the I 2C interface.</description>												
						<bitRange>[7:3]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>DAT</name>														
				<description>I2C Data Register. During master or slave transmit mode, data to be transmitted is written to this register. During master or slave receive mode, data that has been received may be read from this register.</description>														
				<addressOffset>0x008</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>Data</name>												
						<description>This register holds data values that have been received or are to be transmitted.</description>												
						<bitRange>[7:0]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>ADR0</name>														
				<description>I2C Slave Address Register 0. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address.</description>														
				<addressOffset>0x00C</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x00</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>GC</name>												
						<description>General Call enable bit.</description>												
						<bitRange>[0:0]</bitRange>												
					</field>													
					<field>													
						<name>Address</name>												
						<description>The I2C device address for slave mode.</description>												
						<bitRange>[7:1]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>SCLH</name>														
				<description>SCH Duty Cycle Register High Half Word. Determines the high time of the I2C clock.</description>														
				<addressOffset>0x010</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x04</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>SCLH</name>												
						<description>Count for SCL HIGH time period selection.</description>												
						<bitRange>[15:0]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:16]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>SCLL</name>														
				<description>SCL Duty Cycle Register Low Half Word. Determines the low time of the I2C clock. I2nSCLL and I2nSCLH together determine the clock frequency generated by an I2C master and certain times used in slave mode.</description>														
				<addressOffset>0x014</addressOffset>														
				<access>read-write</access>														
				<resetValue>0x04</resetValue>														
				<resetMask>0xFFFFFFFF</resetMask>														
				<fields>														
					<field>													
						<name>SCLL</name>												
						<description>Count for SCL low time period selection.</description>												
						<bitRange>[15:0]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:16]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>															
				<name>CONCLR</name>														
				<description>I2C Control Clear Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is cleared. Writing a zero has no effect on the corresponding bit in the I2C control register.</description>														
				<addressOffset>0x018</addressOffset>														
				<access>write-only</access>														
				<resetValue>0</resetValue>														
				<resetMask>0x00000000</resetMask>														
				<fields>														
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
						<bitRange>[1:0]</bitRange>												
					</field>													
					<field>													
						<name>AAC</name>												
						<description>Assert acknowledge Clear bit.</description>												
						<bitRange>[2:2]</bitRange>												
					</field>													
					<field>													
						<name>SIC</name>												
						<description>I2C interrupt Clear bit.</description>												
						<bitRange>[3:3]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
						<bitRange>[4:4]</bitRange>												
					</field>													
					<field>													
						<name>STAC</name>												
						<description>START flag Clear bit.</description>												
						<bitRange>[5:5]</bitRange>												
					</field>													
					<field>													
						<name>I2ENC</name>												
						<description>I2C interface Disable bit.</description>												
						<bitRange>[6:6]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>												
						<bitRange>[7:7]</bitRange>												
					</field>													
					<field>													
						<name>RESERVED</name>												
						<description>Reserved. The value read from a reserved bit is not defined.</description>												
						<bitRange>[31:8]</bitRange>												
					</field>													
				</fields>														
			</register>															
			<register>
				<name>MMCTRL</name>
				<description>Monitor mode control register.</description>
				<addressOffset>0x01C</addressOffset>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>MM_ENA</name>
						<description>Monitor mode enable.</description>
						<bitRange>[0:0]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>MONITOR_MODE_DISABLE</name>
								<description>Monitor mode disabled.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>THE_I2C_MODULE_WILL_</name>
								<description>The I2C module will enter monitor mode. In this mode the SDA output will be forced high. This will prevent the I2C module from outputting data of any kind (including ACK) onto the I 2C data bus. Depending on the state of the ENA_SCL bit, the output may be also forced high, preventing the module from having control over the I2C clock line.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>ENA_SCL</name>
						<description>SCL output enable.</description>
						<bitRange>[1:1]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>HIGH</name>
								<description>When this bit is cleared to 0, the SCL output will be forced high when the module is in monitor mode. As described above, this will prevent the module from having any control over the I2C clock line.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>NORMAL</name>
								<description>When this bit is set, the I2C module may exercise the same control over the clock line that it would in normal operation. This means that, acting as a slave peripheral, the I2C module can stretch the clock line (hold it low) until it has had time to respond to an I2C interrupt.[1]</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>MATCH_ALL</name>
						<description>Select interrupt register match.</description>
						<bitRange>[2:2]</bitRange>
						<enumeratedValues>
							<name>ENUM</name>
							<enumeratedValue>
								<name>MATCH</name>
								<description>When this bit is cleared, an interrupt will only be generated when a match occurs to one of the (up-to) four address registers described above.   That is, the module will respond as a normal slave as far as address-recognition is concerned.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ANYADDRESS</name>
								<description>When this bit is set to 1 and the I2C is in monitor mode, an interrupt will be generated on ANY address received. This will enable the part to monitor all traffic on the bus.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. The value read from reserved bits is not defined.</description>
						<bitRange>[31:3]</bitRange>
						
