cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV_LPC111x_LV.svd
				</field>
				<field>
					<name>EMC0</name>
					<description>External Match Control 0. Determines the functionality of External Match 0.</description>
					<bitRange>[5:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC1</name>
					<description>External Match Control 1. Determines the functionality of External Match 1.</description>
					<bitRange>[7:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC2</name>
					<description>External Match Control 2. Determines the functionality of External Match 2.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EMC3</name>
					<description>External Match Control 3. Determines the functionality of External Match 3.</description>
					<bitRange>[11:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DO_NOTHING_</name>
							<description>Do Nothing.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CLEAR_THE_CORRESPOND</name>
							<description>Clear the corresponding External Match bit/output to 0 (CT32Bn_MATm pin is LOW if pinned out).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SET_THE_CORRESPONDIN</name>
							<description>Set the corresponding External Match bit/output to 1 (CT32Bn_MATm pin is HIGH if pinned out).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TOGGLE_THE_CORRESPON</name>
							<description>Toggle the corresponding External Match bit/output.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:12]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CTCR</name>
			<description>Count Control Register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
			<addressOffset>0x070</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CTM</name>
					<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: every rising PCLK edge</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_MODE_EVERY_RI</name>
							<description>Timer Mode: every rising PCLK edge</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COUNTER_MODE_TC_IS_</name>
							<description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COUNTER_MODE_TC_IS_</name>
							<description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COUNTER_MODE_TC_IS_</name>
							<description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CIS</name>
					<description>Count Input Select. When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking:</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32BN_CAP0</name>
							<description>CT32Bn_CAP0</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CT32BN_CAP1</name>
							<description>CT32Bn_CAP1</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_NOTE_IF_CO</name>
							<description>Reserved Note: If Counter mode is selected in the TnCTCR, the 3 bits for that input in the Capture Control Register (TnCCR) must be programmed as 000.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ENCC</name>
					<description>Setting this bit to one enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>
					<bitRange>[4:4]</bitRange>

