cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV_LPC111x_LV.svd
				</field>
				<field>
					<name>SELCC</name>
					<description>When bit 4 is one, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is zero.</description>
					<bitRange>[7:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RISING_EDGE_OF_CAP0_</name>
							<description>Rising Edge of CAP0 clears the timer (if bit 4 is set).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGE_OF_CAP0</name>
							<description>Falling Edge of CAP0 clears the timer (if bit 4 is set).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_OF_CAP1_</name>
							<description>Rising Edge of CAP1 clears the timer (if bit 4 is set).</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGE_OF_CAP1</name>
							<description>Falling Edge of CAP1 clears the timer (if bit 4 is set).</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED_</name>
							<description>Reserved.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>PWMC</name>
			<description>PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT32B0_MAT[3:0].</description>
			<addressOffset>0x074</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PWMEN0</name>
					<description>PWM channel 0 enable</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32BN_MAT0_IS_CONTR</name>
							<description>CT32Bn_MAT0 is controlled by EM0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PWM_MODE_IS_ENABLED_</name>
							<description>PWM mode is enabled for CT32Bn_MAT0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMEN1</name>
					<description>PWM channel 1 enable</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32BN_MAT1_IS_CONTR</name>
							<description>CT32Bn_MAT1 is controlled by EM1.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PWM_MODE_IS_ENABLED_</name>
							<description>PWM mode is enabled for CT32Bn_MAT1.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMEN2</name>
					<description>PWM channel 2 enable</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32BN_MAT2_IS_CONTR</name>
							<description>CT32Bn_MAT2 is controlled by EM2.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PWM_MODE_IS_ENABLED_</name>
							<description>PWM mode is enabled for CT32Bn_MAT2.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMEN3</name>
					<description>PWM channel 3 enable Note: It is recommended to use match channel 3 to set the PWM cycle.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>CT32BN_MAT3_IS_CONTR</name>
							<description>CT32Bn_MAT3 is controlled by EM3.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PWM_MODE_IS_ENABLED_</name>
							<description>PWM mode is enabled for CT32Bn_MAT3.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:4]</bitRange>

				</field>
			</fields>
		</register>
	</registers>
</peripheral>
<peripheral>
	<name>CT32B1</name>
	<description>32-bit counter/timer CT32B0/1</description>
	<groupName>CT32B1</groupName>
	<baseAddress>0x40018000</baseAddress>
	<addressBlock>
		<offset>0</offset>
		<size>0xFFF</size>
		<usage>registers</usage>
	</addressBlock>
	<interrupt>
		<name>CT32B1</name>
		<value>19</value>
	</interrupt>
	<registers>
		<register>
			<name>IR</name>
			<description>Interrupt Register (IR). The IR can be written to clear interrupts. The IR can be read to identify which of five possible interrupt sources are pending.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MR0INT</name>
					<description>Interrupt flag for match channel 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MR1INT</name>
					<description>Interrupt flag for match channel 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MR2INT</name>
					<description>Interrupt flag for match channel 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MR3INT</name>
					<description>Interrupt flag for match channel 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CR0INT</name>
					<description>Interrupt flag for capture channel 0 event.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CR1INT</name>
					<description>Interrupt flag for capture channel 1 event.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TCR</name>
			<description>Timer Control Register (TCR). The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CEN</name>
					<description>When one, the Timer Counter and Prescale Counter are enabled for counting. When zero, the counters are disabled.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CRST</name>
					<description>When one, the Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TC</name>
			<description>Timer Counter (TC). The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TC</name>
					<description>Timer counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PR</name>
			<description>Prescale Register (PR). When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PR</name>
					<description>Prescale value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PC</name>
			<description>Prescale Counter (PC). The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PC</name>
					<description>Prescale counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCR</name>
			<description>Match Control Register (MCR). The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MR0I</name>
					<description>Interrupt on MR0: an interrupt is generated when MR0 matches the value in the TC.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR0R</name>
					<description>Reset on MR0: the TC will be reset if MR0 matches it.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR0S</name>
					<description>Stop on MR0: the TC and PC will be stopped and TCR[0] will be set to 0 if MR0 matches the TC.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1I</name>
					<description>Interrupt on MR1: an interrupt is generated when MR1 matches the value in the TC.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1R</name>
					<description>Reset on MR1: the TC will be reset if MR1 matches it.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR1S</name>
					<description>Stop on MR1: the TC and PC will be stopped and TCR[0] will be set to 0 if MR1 matches the TC.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2I</name>
					<description>Interrupt on MR2: an interrupt is generated when MR2 matches the value in the TC.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2R</name>
					<description>Reset on MR2: the TC will be reset if MR2 matches it.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR2S</name>
					<description>Stop on MR2: the TC and PC will be stopped and TCR[0] will be set to 0 if MR2 matches the TC.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3I</name>
					<description>Interrupt on MR3: an interrupt is generated when MR3 matches the value in the TC.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3R</name>
					<description>Reset on MR3: the TC will be reset if MR3 matches it.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MR3S</name>
					<description>Stop on MR3: the TC and PC will be stopped and TCR[0] will be set to 0 if MR3 matches the TC.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:12]</bitRange>

