cmsis-svd/cmsis-svd/data/NXP/LPC11xxLV_LPC111x_LV.svd
	</registers>																						
	</peripheral>	
	
  	<peripheral>
  		<name>FLASHCTRL</name>
  		<description>Flash controller </description>
  		<groupName>FLASHCTRL</groupName>
  		<baseAddress>0x4003C000</baseAddress>
  		<addressBlock>
  			<offset>0</offset>
  			<size>0xFFF</size>
  			<usage>registers</usage>
  		</addressBlock>
  		<interrupt>
  			<name>FMC</name>
  			<value>27</value>
  		</interrupt>
  		<registers>
  			<register>
  				<name>FLASHCFG</name>
  				<description>Flash memory access time configuration register</description>
  				<addressOffset>0x010</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>FLASHTIM</name>
  						<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
  						<bitRange>[1:0]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>1_SYSTEM_CLOCK_FLASH</name>
  								<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
  								<value>0x1</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>2_SYSTEM_CLOCKS_FLAS</name>
  								<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
  								<value>0x2</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>3_SYSTEM_CLOCKS_FLAS</name>
  								<description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>
  								<value>0x3</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>
  						<bitRange>[31:2]</bitRange>
  						
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSSTART</name>
  				<description>Signature start address register</description>
  				<addressOffset>0x020</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>START</name>
  						<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>
  						<bitRange>[16:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[31:17]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSSTOP</name>
  				<description>Signature stop-address register</description>
  				<addressOffset>0x024</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>STOP</name>
  						<description>BIST stop address divided by 16 (corresponds to AHB byte address [20:4]).</description>
  						<bitRange>[16:0]</bitRange>
  						
  					</field>
  					<field>
  						<name>SIG_START</name>
  						<description>Start control bit for signature generation.</description>
  						<bitRange>[17:17]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>SIGNATURE_GENERATION</name>
  								<description>Signature generation is stopped</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>INITIATE_SIGNATURE_G</name>
  								<description>Initiate signature generation</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[31:18]</bitRange>
  						
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSW0</name>
  				<description>Word 0 [31:0]</description>
  				<addressOffset>0x02C</addressOffset>
  				<access>read-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>SW0_31_0</name>
  						<description>Word 0 of 128-bit signature (bits 31 to 0).</description>
  						<bitRange>[31:0]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSW1</name>
  				<description>Word 1 [63:32]</description>
  				<addressOffset>0x030</addressOffset>
  				<access>read-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>SW1_63_32</name>
  						<description>Word 1 of 128-bit signature (bits 63 to 32).</description>
  						<bitRange>[31:0]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSW2</name>
  				<description>Word 2 [95:64]</description>
  				<addressOffset>0x034</addressOffset>
  				<access>read-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>SW2_95_64</name>
  						<description>Word 2 of 128-bit signature (bits 95 to 64).</description>
  						<bitRange>[31:0]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSW3</name>
  				<description>Word 3 [127:96]</description>
  				<addressOffset>0x038</addressOffset>
  				<access>read-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>SW3_127_96</name>
  						<description>Word 3 of 128-bit signature (bits 127 to 96).</description>
  						<bitRange>[31:0]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSTAT</name>
  				<description>Signature generation status register</description>
  				<addressOffset>0xFE0</addressOffset>
  				<access>read-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[1:0]</bitRange>
  					</field>
  					<field>
  						<name>SIG_DONE</name>
  						<description>When 1, a previously started signature generation has completed. See FMSTATCLR register description for clearing this flag.</description>
  						<bitRange>[2:2]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[31:3]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>FMSTATCLR</name>
  				<description>Signature generation status clear register</description>
  				<addressOffset>0xFE8</addressOffset>
  				<access>write-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[1:0]</bitRange>
  					</field>
  					<field>
  						<name>SIG_DONE_CLR</name>
  						<description>Writing a 1 to this bits clears the signature generation completion flag (SIG_DONE) in the FMSTAT register.</description>
  						<bitRange>[2:2]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
  						<bitRange>[31:3]</bitRange>
  					</field>
  				</fields>
  			</register>
